{"format": "layers-model", "generatedBy": "keras3-tfjs-export", "convertedBy": "custom-patch-script", "modelTopology": {"class_name": "Model", "config": {"name": "functional", "trainable": true, "layers": [{"class_name": "InputLayer", "name": "vibration_input", "config": {"dtype": "float32", "sparse": false, "ragged": false, "name": "vibration_input", "batchInputShape": [null, 57]}, "inbound_nodes": []}, {"class_name": "Dense", "name": "shared_1", "config": {"name": "shared_1", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["vibration_input", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "inbound_nodes": [[["shared_1", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.3, "seed": null, "noise_shape": null}, "inbound_nodes": [[["batch_normalization", 0, 0]]]}, {"class_name": "Dense", "name": "shared_2", "config": {"name": "shared_2", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "inbound_nodes": [[["shared_2", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "seed": null, "noise_shape": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0]]]}, {"class_name": "Dense", "name": "shared_3", "config": {"name": "shared_3", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"class_name": "Dense", "name": "sev_hidden", "config": {"name": "sev_hidden", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["shared_3", 0, 0]]]}, {"class_name": "Dense", "name": "fault_type", "config": {"name": "fault_type", "trainable": true, "dtype": "float32", "units": 6, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["shared_3", 0, 0]]]}, {"class_name": "Dense", "name": "severity", "config": {"name": "severity", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["sev_hidden", 0, 0]]]}], "input_layers": [["vibration_input", 0, 0]], "output_layers": [["fault_type", 0, 0], ["severity", 0, 0]]}, "compile_config": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "kernel", "shape": [57, 128], "dtype": "float32"}, {"name": "bias", "shape": [128], "dtype": "float32"}, {"name": "gamma", "shape": [128], "dtype": "float32"}, {"name": "beta", "shape": [128], "dtype": "float32"}, {"name": "moving_mean", "shape": [128], "dtype": "float32"}, {"name": "moving_variance", "shape": [128], "dtype": "float32"}, {"name": "kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "bias", "shape": [64], "dtype": "float32"}, {"name": "gamma", "shape": [64], "dtype": "float32"}, {"name": "beta", "shape": [64], "dtype": "float32"}, {"name": "moving_mean", "shape": [64], "dtype": "float32"}, {"name": "moving_variance", "shape": [64], "dtype": "float32"}, {"name": "kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "bias", "shape": [32], "dtype": "float32"}, {"name": "kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "bias", "shape": [16], "dtype": "float32"}, {"name": "kernel", "shape": [32, 6], "dtype": "float32"}, {"name": "bias", "shape": [6], "dtype": "float32"}, {"name": "kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "bias", "shape": [1], "dtype": "float32"}]}]}