{"format": "layers-model", "generatedBy": "keras3-tfjs-export", "convertedBy": "custom-patch-script", "modelTopology": {"class_name": "Model", "config": {"name": "anomaly_autoencoder", "trainable": true, "layers": [{"class_name": "InputLayer", "name": "input", "config": {"dtype": "float32", "sparse": false, "ragged": false, "name": "input", "batchInputShape": [null, 57]}, "inbound_nodes": []}, {"class_name": "Model", "name": "encoder", "config": {"name": "encoder", "trainable": true, "layers": [{"class_name": "InputLayer", "name": "input_layer", "config": {"dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer", "batchInputShape": [null, 57]}, "inbound_nodes": []}, {"class_name": "Dense", "name": "dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_layer", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "inbound_nodes": [[["dense", 0, 0]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "inbound_nodes": [[["dense_1", 0, 0]]]}, {"class_name": "Dense", "name": "z_mean", "config": {"name": "z_mean", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0]]]}, {"class_name": "Dense", "name": "z_log_var", "config": {"name": "z_log_var", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0]]]}, {"class_name": "Sampling", "name": "z", "config": {"name": "z", "activity_regularizer": null, "trainable": true, "dtype": "float32", "autocast": true}, "inbound_nodes": [[["z_mean", 0, 0], ["z_log_var", 0, 0]]]}], "input_layers": [["input_layer", 0, 0]], "output_layers": [["z_mean", 0, 0], ["z_log_var", 0, 0], ["z", 0, 0]]}, "inbound_nodes": [[["input", 0, 0]]]}, {"class_name": "Model", "name": "decoder", "config": {"name": "decoder", "trainable": true, "layers": [{"class_name": "InputLayer", "name": "input_layer_1", "config": {"dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer_1", "batchInputShape": [null, 16]}, "inbound_nodes": []}, {"class_name": "Dense", "name": "dense_2", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_layer_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "inbound_nodes": [[["dense_2", 0, 0]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_2", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "inbound_nodes": [[["dense_3", 0, 0]]]}, {"class_name": "Dense", "name": "dense_4", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 57, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_3", 0, 0]]]}], "input_layers": [["input_layer_1", 0, 0]], "output_layers": [["dense_4", 0, 0]]}, "inbound_nodes": [[["encoder", 0, 0]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["decoder", 1, 0]]}, "compile_config": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "encoder/kernel", "shape": [57, 64], "dtype": "float32"}, {"name": "encoder/bias", "shape": [64], "dtype": "float32"}, {"name": "encoder/gamma", "shape": [64], "dtype": "float32"}, {"name": "encoder/beta", "shape": [64], "dtype": "float32"}, {"name": "encoder/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "encoder/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "encoder/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "encoder/bias", "shape": [32], "dtype": "float32"}, {"name": "encoder/gamma", "shape": [32], "dtype": "float32"}, {"name": "encoder/beta", "shape": [32], "dtype": "float32"}, {"name": "encoder/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "encoder/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "encoder/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "encoder/bias", "shape": [16], "dtype": "float32"}, {"name": "encoder/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "encoder/bias", "shape": [16], "dtype": "float32"}, {"name": "decoder/kernel", "shape": [16, 32], "dtype": "float32"}, {"name": "decoder/bias", "shape": [32], "dtype": "float32"}, {"name": "decoder/gamma", "shape": [32], "dtype": "float32"}, {"name": "decoder/beta", "shape": [32], "dtype": "float32"}, {"name": "decoder/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "decoder/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "decoder/kernel", "shape": [32, 64], "dtype": "float32"}, {"name": "decoder/bias", "shape": [64], "dtype": "float32"}, {"name": "decoder/gamma", "shape": [64], "dtype": "float32"}, {"name": "decoder/beta", "shape": [64], "dtype": "float32"}, {"name": "decoder/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "decoder/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "decoder/kernel", "shape": [64, 57], "dtype": "float32"}, {"name": "decoder/bias", "shape": [57], "dtype": "float32"}]}]}