{"format": "layers-model", "generatedBy": "keras3-tfjs-export", "convertedBy": "custom-patch-script", "modelTopology": {"class_name": "Sequential", "config": {"name": "cavitation_detector", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "name": "input_layer", "config": {"dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer", "batchInputShape": [null, 57]}, "inbound_nodes": []}, {"class_name": "Dense", "name": "dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": []}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "inbound_nodes": []}, {"class_name": "Dropout", "name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.3, "seed": null, "noise_shape": null}, "inbound_nodes": []}, {"class_name": "Dense", "name": "dense_1", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": []}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "inbound_nodes": []}, {"class_name": "Dropout", "name": "dropout_3", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.2, "seed": null, "noise_shape": null}, "inbound_nodes": []}, {"class_name": "Dense", "name": "dense_2", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": []}, {"class_name": "Dense", "name": "dense_3", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": []}], "build_input_shape": [null, 57]}, "compile_config": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "kernel", "shape": [57, 64], "dtype": "float32"}, {"name": "bias", "shape": [64], "dtype": "float32"}, {"name": "gamma", "shape": [64], "dtype": "float32"}, {"name": "beta", "shape": [64], "dtype": "float32"}, {"name": "moving_mean", "shape": [64], "dtype": "float32"}, {"name": "moving_variance", "shape": [64], "dtype": "float32"}, {"name": "kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "bias", "shape": [32], "dtype": "float32"}, {"name": "gamma", "shape": [32], "dtype": "float32"}, {"name": "beta", "shape": [32], "dtype": "float32"}, {"name": "moving_mean", "shape": [32], "dtype": "float32"}, {"name": "moving_variance", "shape": [32], "dtype": "float32"}, {"name": "kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "bias", "shape": [16], "dtype": "float32"}, {"name": "kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "bias", "shape": [1], "dtype": "float32"}]}]}